// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б


//   function foo(a,b) {
//     return (a+b)*2;
//   }
//
// console.log(foo(2,3));



// - створити функцію яка обчислює та повертає площу кола з радіусом r

// function foo2(r) {
//     return (r*2);
// }
//
// console.log(foo2(5));



// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function foo3 (h,r) {
//     return ((r*2)+h)*2;
// }
//
// console.log(foo3(8,3));



// - створити функцію яка приймає масив та виводить кожен його елемент



// - створити функцію яка створює параграф з текстом. Текст задати через аргумент



// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий



// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//     Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

function foo7(text,count) {
    document.write(`<ul>`);
    for (let i = 0; i < count; i++){
        document.write(`<div>${text}</div>`);
    }
    document.write(`</ul>`)
}
foo7 ('text',4);



// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// const arrey = [1,2,'bybyby',true,[5,10]];
// function foo8(arr){
// document.write(`<ul>`);
// for (const item of arr) {
//     document.write(`<li>${item}</li>`);
// }
// document.write(`</ul>`);
// }
// foo8(arrey);



// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.' +
// ' Для кожного об'єкту окремий блок.




// - створити функцію яка повертає найменьше число з масиву
//



// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його.
//     Приклад sum([1,2,10]) //->13




// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]




// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250